void s3()
  {
    arm_ready();       // เตียมมือจับตอนเข้าคีบ

    arm_start_new();    //เอาแขนลงและวจับกระป๋องใหม่ ทั้ง 2 ข้าง
    arm_start_new_L();  //เอาแขนลงและวจับกระป๋องใหม่ ข้าง ซ้าย
    arm_start_new_R();  //เอาแขนลงและวจับกระป๋องใหม่ ข้าง ขวา

    armL_to_armR();      //------->> เปลี่ยนกระป๋องจากมือ ซ้าย ไปมือ ขวา
    armR_to_armL();  //------->> เปลี่ยนกระป๋องจากมือ ขวา ไปมือ ซ้าย

    armLR_to_can();   //เอากระป๋องจากมือทั้ง 2 ข้าง ไปเก็บที่ช่องเก็บ 
    armL_to_can();    //เอากระป๋องจากมือซ้าย ไปเก็บที่ช่องซ้าย
    armR_to_can();    //เอากระป๋องจากมือขวา ไปเก็บที่ช่องขวา


    can_to_armL();    //เอากระป๋องจากที่ช่องซ้าย ไปให้มือซ้าย
    can_to_armR();    //เอากระป๋องจากที่ช่องขวา ไปให้มือขวา

    arm_updown(0);    //เอาแขนขึ้น  ลง





  }