void s2()
  {
    
    go_to_mission_to_can(0, 7);  // 0 คือ ระยะยกขึ้น  0 กระป๋องวางที่พื้น     , ระยะ 7
    go_to_mission_to_can(5, 7);  // 5 คือ ระยะยกขึ้น  5 กระป๋องวางที่แท่น   ,ระยะ 7

    go_to_mission_to_can(0, 20);  // 0 คือ ระยะยกขึ้น  0 กระป๋องวางที่พื้น     , 20 คือระยะทางที่วิ่งเข้าไปหากระป๋อง 
    go_to_mission_to_can(5, 20);  // 5 คือ ระยะยกขึ้น  5 กระป๋องวางที่แท่น   ,20 คือระยะทางที่วิ่งเข้าไปหากระป๋อง 

    go_to_mission_on_stand('L',  5, 80);    // L คือเอามือซ้ายเข้าไปวาง   5 คือ ระยะที่ยกแขนขึ้น 80 องศาวาง
    go_to_mission_on_stand('R',  5, 60);    // R คือเอามือขวาเข้าไปวาง   5 คือ ระยะที่ยกแขนขึ้น 60 องศาวาง
    go_to_mission_on_stand('T',  5, 80);    // L คือเอามือทั้งสองเข้าไปวาง   5 คือ ระยะที่ยกแขนขึ้น


   move(30,  30, 1.5, 15, 0, 1);
   go_to_mission_to_can(0, 20);  // 0 คือ ระยะยกขึ้น  0 กระป๋องวางที่พื้น     , ระยะ 7

   move(40,  40, 1.5, 48, 0, 1);
   go_to_mission_to_can(0, 20);  // 0 คือ ระยะยกขึ้น  0 กระป๋องวางที่พื้น     , ระยะ 7


  }