void s1()
  {
    move(40,  40, 1.5, 30, 15, 1);
    turnGyro(70, -90); 
    setrobot_bw(2);   //----->>ถอยหลังเซต


    move(40,  40, 1.5, 30, 0, 1);
    setrobot_fw(2);   //----->>ถอยหลังเซต
    turnGyro(70, -90); 
    setrobot_bw(2);   //----->>ถอยหลังเซต


    move(75,  75, 1.5, 60, 15, 1);
    turnGyro(70, -90); 
    setrobot_bw(2);   //----->>ถอยหลังเซต


    move(75,  75, 1.5, 60, 0, 1);
    setrobot_fw(2);   //----->>ถอยหลังเซต
    turnGyro(70, -90); 
    setrobot_bw(2);   //----->>ถอยหลังเซต

    move(-40,  -40, 1.5, 30, 15, 1);
    turnGyro(70, -90); 
    setrobot_bw(2);   //----->>ถอยหลังเซต


    move(-40,  -40, 1.5, 30, 0, 1);
    setrobot_bw(2);   //----->>ถอยหลังเซต
    turnGyro(70, -90); 
    setrobot_bw(2);   //----->>ถอยหลังเซต







  }