void mission_1() 
{
  arm_updown(0);  //เอาแขนขึ้น  ลง   ////แดงซ้าย เขียวขวา
    setrobot_bw(2);   //----->>ถอยหลังเซต

   move(40,  40, 1.5, 34, 0, 1);
   turnGyro(80, 90); 
     arm_ready();       // เตียมมือจับตอนเข้าคี
   move(30,  30, 1.5, 19, 0, 1);
 
   go_to_mission_to_can(0, 20);  // 0 คือ ระยะยกขึ้น  0 กระป๋องวางที่พื้น     , ระยะ 7
   armLR_to_can();   //เอากระป๋องจากมือทั้ง 2 ข้าง ไปเก็บที่ช่องเก็บ 

    setrobot_fw(2);   //----->>ถอยหลังเซต
  
  
    move(-40,  -40, 1.5, 28, 15, 1);
  arm_updown(0);  //เอาแขนขึ้น  ลง   ////แดงซ้าย เขียวขวา

    turnGyro(75, -90); 
   arm_ready();       // เตียมมือจับตอนเข้าคี

    move(30,  30, 1.5, 18, 0, 1);
   go_to_mission_to_can(0, 20);  // 0 คือ ระยะยกขึ้น  0 กระป๋องวางที่พื้น     , ระยะ 7
    move(30,  30, 1.5, 20, 0, 1);

    arm_start_new();    //เอาแขนลงและวจับกระป๋องใหม่ ทั้ง 2 ข้าง

    go_to_mission_on_stand('L',  16, 80);    // L คือเอามือซ้ายเข้าไปวาง   5 คือ ระยะที่ยกแขนขึ้น 80 องศาวาง
    move(-40,  -40, 1.5, 15, 15, 16);

    armR_to_armL();  //------->> เปลี่ยนกระป๋องจากมือ ขวา ไปมือ ซ้าย
    can_to_armR();    //  เอากระป๋องจากที่ช่องขวา ไปให้มือขวา

    arm_start_new();    //เอาแขนลงและวจับกระป๋องใหม่ ทั้ง 2 ข้าง
    go_to_mission_on_stand('R',  16, 60);    // R คือเอามือขวาเข้าไปวาง   5 คือ ระยะที่ยกแขนขึ้น 60 องศาวาง
    
      move(-40,  -40, 1.5, 30, 0, 16);
      move(-40,  -40, 1.5, 32, 0, 1);

    turnGyro(70, -90); 

        move(30,  30, 1.5, 20, 0, 1);

    armL_to_armR();      //------->> เปลี่ยนกระป๋องจากมือ ซ้าย ไปมือ ขวา 
    can_to_armL();    //เอากระป๋องจากที่ช่องซ้าย ไปให้มือซ้าย

    arm_start_new();    //เอาแขนลงและวจับกระป๋องใหม่ ทั้ง 2 ข้าง

    go_to_mission_on_stand('T',  10, 80);    // L คือเอามือซ้ายเข้าไปวาง   5 คือ ระยะที่ยกแขนขึ้น 80 องศาวาง
    move(-40,  -40, 1.5, 25, 15, 10);

    turnGyro(70, -90); 
    move(30,  30, 1.5, 40, 0, 1);

} 