void mission_1() 
{
    
      arm_updown(0);  //เอาแขนขึ้น  ลง   ////แดงซ้าย เขียวขวา
    setrobot_bw(2);   //----->>ถอยหลังเซต

    move(40,  40, 1.5, 33, 0, 1);

    turnGyro(75, 90); 
    setrobot_bw(2);   //----->>ถอยหลังเซต
    arm_ready();
    move(40,  40, 1.5, 25, 0, 1);

    move(30,  30, 1.5, 10, 0, 1);
    go_to_mission_to_can(0, 6);  // 0 คือ ระยะยกขึ้น  0 กระป๋องวางที่พื้น     , ระยะ 7
    armLR_to_can();   //เอากระป๋องจากมือทั้ง 2 ข้าง ไปเก็บที่ช่องเก็บ 
 
 
    
    move(50,  50, 1.5, 30, 0, 1);
    arm_ready();

    move(30,  30, 1.5, 15, 0, 1);
    go_to_mission_to_can(0, 6);  // 0 คือ ระยะยกขึ้น  0 กระป๋องวางที่พื้น     , ระยะ 7

    move(-40, -40, 1.5, 30, 0, 1);
    turnGyro(75, 90); 
    move(-40, -40, 1.5, 28, 0, 1);

    setrobot_bw(2);   //----->>ถอยหลังเซต
    turnGyro(75, 90); 

    arm_start_new();    //เอาแขนลงและวจับกระป๋องใหม่ ทั้ง 2 ข้าง

    go_to_mission_on_stand('L',  15, 80);    // L คือเอามือซ้ายเข้าไปวาง   5 คือ ระยะที่ยกแขนขึ้น 80 องศาวาง
    move(-40, -40, 1.5, 15, 0, 15);
    can_to_armL();    //เอากระป๋องจากที่ช่องขวา ไปให้มือขวา
    arm_start_new();    //เอาแขนลงและวจับกระป๋องใหม่ ทั้ง 2 ข้าง

    go_to_mission_on_stand('L',  15, 45);    // L คือเอามือซ้ายเข้าไปวาง   5 คือ ระยะที่ยกแขนขึ้น 80 องศาวาง
    move(-40, -40, 1.5, 20, 0, 15);

    armR_to_armL();  //------->> เปลี่ยนกระป๋องจากมือ ขวา ไปมือ ซ้าย
    armL_to_can();    //เอากระป๋องจากมือซ้าย ไปเก็บที่ช่องซ้าย

    
    arm_updown(0);
    turnGyro(75, -90); 
    setrobot_bw(2);   //----->>ถอยหลังเซต
    move(60,  60, 1.5, 48, 0, 1);
    arm_ready();

    move(30,  30, 1.5, 12, 0, 1);
    go_to_mission_to_can(0, 6);  // 0 คือ ระยะยกขึ้น  0 กระป๋องวางที่พื้น     , ระยะ 7

    move(-60, -60, 1.5, 60, 0, 1);
    setrobot_bw(2);   //----->>ถอยหลังเซต
    turnGyro(75, -90); 

    arm_start_new();    //เอาแขนลงและวจับกระป๋องใหม่ ทั้ง 2 ข้าง
    
     go_to_mission_on_stand('R',  19, 80);    // L คือเอามือซ้ายเข้าไปวาง   5 คือ ระยะที่ยกแขนขึ้น 80 องศาวาง
    move(-40, -40, 1.5, 15, 0, 19);
    armL_to_armR();  //------->> เปลี่ยนกระป๋องจากมือ ขวา ไปมือ ซ้าย
   
    can_to_armL();    //เอากระป๋องจากที่ช่องซ้าย ไปให้มือซ้าย
    arm_start_new();    //เอาแขนลงและวจับกระป๋องใหม่ ทั้ง 2 ข้าง
    go_to_mission_on_stand('L',  20, 45);    // L คือเอามือซ้ายเข้าไปวาง   5 คือ ระยะที่ยกแขนขึ้น 80 องศาวาง
    move(-40, -40, 1.5, 20, 0, 20);
    move(-40, -40, 1.5, 10, 0, 1);

     turnGyro(75, 90); 
    setrobot_bw(2);   //----->>ถอยหลังเซต

    move(40, 40, 1.5, 35, 0, 1);
     turnGyro(75, 90); 
    move(-40, -40, 1.5, 30, 0, 1);

    setrobot_bw(2);   //----->>ถอยหลังเซต
     turnGyro(75, -90); 

    armR_to_armL();  //------->> เปลี่ยนกระป๋องจากมือ ขวา ไปมือ ซ้าย
    can_to_armR();    //เอากระป๋องจากที่ช่องขวา ไปให้มือขวา

     arm_start_new();    //เอาแขนลงและวจับกระป๋องใหม่ ทั้ง 2 ข้าง
    
     go_to_mission_on_stand('T',  12, 80);    // L คือเอามือซ้ายเข้าไปวาง   5 คือ ระยะที่ยกแขนขึ้น 80 องศาวาง
    move(-40, -40, 1.5, 15, 0, 12);
    move(-40, -40, 1.5, 10, 0, 1);
   

    
    













//     move(40,  40, 1.5, 27, 0, 1);
//     setrobot_fw(2);   //----->>ถอยหลังเซต
//     turnGyro(75, 90); 
//     setrobot_bw(2);   //----->>ถอยหลังเซต
   
//     move(60,  60, 1.5, 80, 0, 6);
//     setrobot_fw(2);   //----->>ถอยหลังเซต
//     turnGyro(75, -90); 
    
//     arm_ready();

//      move(30,  30, 1.5, 18, 0, 1);
//     go_to_mission_to_can(0, 6);  // 0 คือ ระยะยกขึ้น  0 กระป๋องวางที่พื้น     , ระยะ 7

    
//     move(-40,  -40, 1.5, 25, 15, 1);
//     armLR_to_can();   //เอากระป๋องจากมือทั้ง 2 ข้าง ไปเก็บที่ช่องเก็บ 
//     arm_updown(0);
//     turnGyro(75, -90); 
    
//     setrobot_bw(2);   //----->>ถอยหลังเซต
//     turnGyro(75, -90); 
    
//     arm_ready();
   
//     move(30,  30, 1.5, 22, 0, 1);
//     go_to_mission_to_can(0, 6);  // 0 คือ ระยะยกขึ้น  0 กระป๋องวางที่พื้น     , ระยะ 7

//     move(-40,  -40, 1.5, 36, 0, 3);
//     turnGyro(75, 90); 

//     setrobot_bw(2);   //----->>ถอยหลังเซต

//     move(40,  40, 1.5, 35, 0, 3);
//     turnGyro(75, -90); 
//     move(40,  40, 1.5, 38, 0, 3);
//      turnGyro(75, 90); 
//     setrobot_bw(2);   //----->>ถอยหลังเซต

//     turnGyro(75, -90); 
    
//     move_bridge(50,  50, 1.5, 50, 15, 1);
//     turnGyro(75, 90); 
//     setrobot_fw(2);   //----->>ถอยหลังเซต

//     turnGyro(75, 90); 
//     move_bridge(-60,  -60, 1.5, 53, 0, 1);
//     setrobot_bw(2);
    
//     turnGyro(75, 90); 

//     arm_start_new();    //เอาแขนลงและวจับกระป๋องใหม่ ทั้ง 2 ข้าง
//     go_to_mission_on_stand('R',  9, 40);    // L คือเอามือซ้ายเข้าไปวาง   5 คือ ระยะที่ยกแขนขึ้น 80 องศาวาง
//     move(-40, -40, 1.5, 15, 0, 9);
//     can_to_armR();    //เอากระป๋องจากที่ช่องขวา ไปให้มือขวา
//    go_to_mission_on_stand('R',  9, 90);    // L คือเอามือซ้ายเข้าไปวาง   5 คือ ระยะที่ยกแขนขึ้น 80 องศาวาง
//     move(-40, -40, 1.5, 20, 0, 9);

//     armL_to_armR();      //------->> เปลี่ยนกระป๋องจากมือ ซ้าย ไปมือ ขวา
//     armR_to_can();    //เอากระป๋องจากมือขวา ไปเก็บที่ช่องขวา
//     arm_ready();

//     move(-40, -40, 1.5, 35, 0, 1);
//      turnGyro(75, -90); 
//     setrobot_bw(2);   //----->>ถอยหลังเซต
//      move(30,  30, 1.5, 21, 0, 1);
//     go_to_mission_to_can(0, 6);  // 0 คือ ระยะยกขึ้น  0 กระป๋องวางที่พื้น     , ระยะ 7
    
//      move(-40,  -40, 1.5, 30, 0, 3);
//     setrobot_bw(2);   //----->>ถอยหลังเซต

//     turnGyro(75, 90); 
//     move(40,  40, 1.5, 30, 0, 3);
//     turnGyro(75, -90); 
//     setrobot_bw(2);   //----->>ถอยหลังเซต

//      move_bridge(50,  50, 1.5, 55, 15, 3);
//     turnGyro(75, -90); 
//     setrobot_fw(2);   //----->>ถอยหลังเซต

//     turnGyro(75, 90); 
//     move_bridge(60,  60, 1.5, 50, 0, 3);
//       turnGyro(75, -90); 
//     setrobot_bw(2);
//     turnGyro(75, 90); 

//      move(30,  30, 1.5, 30, 0, 3);

    
//     arm_start_new();    //เอาแขนลงและวจับกระป๋องใหม่ ทั้ง 2 ข้าง
//     go_to_mission_on_stand('R',  15, 40);    // L คือเอามือซ้ายเข้าไปวาง   5 คือ ระยะที่ยกแขนขึ้น 80 องศาวาง
//     move(-40, -40, 1.5, 15, 0, 15);
//     can_to_armR();    //เอากระป๋องจากที่ช่องขวา ไปให้มือขวา
//    go_to_mission_on_stand('R',  15, 90);    // L คือเอามือซ้ายเข้าไปวาง   5 คือ ระยะที่ยกแขนขึ้น 80 องศาวาง
//     move(-40, -40, 1.5, 20, 0, 15);

//     arm_ready();

//     turnGyro(75, 90); 

//      move(30,  30, 1.5, 30, 0, 7);
//      setrobot_fw(2);   //----->>ถอยหลังเซต

//     turnGyro(75, 90); 
//     armL_to_armR();      //------->> เปลี่ยนกระป๋องจากมือ ซ้าย ไปมือ ขวา
//     can_to_armL();    //เอากระป๋องจากที่ช่องซ้าย ไปให้มือซ้าย
//      move(30,  30, 1.5, 30, 0, 1);

    
//     arm_start_new();    //เอาแขนลงและวจับกระป๋องใหม่ ทั้ง 2 ข้าง

//    go_to_mission_on_stand('T',  20, 80);    // L คือเอามือซ้ายเข้าไปวาง   5 คือ ระยะที่ยกแขนขึ้น 80 องศาวาง
//     move(-40, -40, 1.5, 20, 0, 20);


} 