#include <MyRP_Pico2.h>
MyRP_Pico2 robot;

//----------------------------------------------------------------------------->> ตั้งค่ามือจับ
int servo_down = 35;        //-------------------->> ตั้งค่า มื่อจับลงขนานกับพื้น
int servoL_open = 120;      //-------------------->> ตั้งค่า กางฝ่ามือด้านซ้าย
int servoR_open = 120;      //-------------------->> ตั้งค่า กางฝ่ามือด้านขวา
//----------------------------------------------------------------------------->> ตั้งค่ามือจับ
//----------------------------------------------------------------------------->> ตั้งค่ามือจับ

void setup() 
  {
    robot.begin();
    set_motor();
    //arm_down_open();
    robot.sw();
    
     robot.fline(30, 30, 0.40, "30", 'n', 's', 90, "a6", 10);
     robot.sw();
     robot.bline(30, 30, 0.40, "30", 'n', 's', 90, "a6", 10);
     robot.sw();
    
  }

void loop() 
  {
    


  }
