void s2()
  {
    
    go_mission_on_floor();  // เข้าคีบที่พื้น

   go_mission_on_stand(); //เข้าคีบบนแท่น 5 เซนติเมตร

  ///---------------------------------------------------------------------------เอากระป๋องออกมาจากที่เก็บ วางบนแทน 5 cm
  can_to_armL();  
  go_to_mission_on_stand(20,  70, 8);   // ตัวแปรตัวสุดท้ายคือ ความสูงของแขน
  
  ///---------------------------------------------------------------------------เอากระป๋องออกมาจากที่เก็บ วางบนแทน 10 cm
  arm_updown(14);      //  ยกขึ้น 13
  go_to_mission_on_stand('L',  70, 9);   // ตัวแปรตัวสุดท้ายคือ ความสูงของแขน เลื่อนลง 9



  arm_updown(19);   //  ยกขึ้น 19
  go_to_mission_on_stand('L',  70, 17);   // ตัวแปรตัวสุดท้ายคือ ความสูงของแขน  เลื่อนลง 17


  }