void s3()
  {
    arm_ready();       // เตียมมือจับตอนเข้าคีบ

    arm_start_new();    //เอาแขนลงและวจับกระป๋องใหม่ ทั้ง 2 ข้าง
    arm_start_new_L();  //เอาแขนลงและวจับกระป๋องใหม่ ข้าง ซ้าย
    arm_start_new_R();  //เอาแขนลงและวจับกระป๋องใหม่ ข้าง ขวา

    armL_to_armR(); 
    armR_to_armL();

    armLR_to_can();      //เอากระป๋องจากมือซ้ายไปเก็บที่เก็บกระป๋องซ้าย
    armL_to_can();      //เอากระป๋องจากมือซ้ายไปเก็บที่เก็บกระป๋องซ้าย
    armR_to_can();      //เอากระป๋องจากมือขวาไปเก็บที่เก็บกระป๋องขวา

     can_to_armR();    //เอากระป๋องจากที่ช่องขวา ไปให้มือขวา

    can_to_armL_5cm();       //----->> ย้ายจากมือขวาไปซ้ายแล้ววางบนแท่น 5cm  ****
    can_to_armL_10cm();       //----->> ย้ายจากมือซ้ายไปขวาแล้ววางบนแท่น 10cm  ****
    can_to_armL_15cm();       //----->> ย้ายจากมือซ้ายไปขวาแล้ววางบนแท่น 15cm  ****

    can_to_armR_5cm();       //----->> ย้ายจากมือขวาไปซ้ายแล้ววางบนแท่น 5cm  ****
    can_to_armR_10cm();       //----->> ย้ายจากมือขวาไปซ้ายแล้ววางบนแท่น 10cm  ****
    can_to_armR_15cm();       //----->> ย้ายจากมือขวาไปซ้ายแล้ววางบนแท่น 15cm  ****
  
    

    arm_updown(0);    //เอาแขนขึ้น  ลง



  }