void mission_2() 
  {
    arm_updown(0);
    move(40,  40, 1.5, 64, 10, 2);
    turnGyro(70, 90, true);   //----->>หมุนตามทิศ
    setrobot_bw(1);   //----->>ถอยหลังเซต

    move(40,  40, 1.5, 30, 10, 2);
    //////////////////////////////////////////////////คีบกระป๋องแรก
    arm_ready();       // เตียมมือจับตอนเข้าคี
    go_mission_on_floor();  // เข้าคีบที่พื้น
    armLR_to_can();      //เอากระป๋องจากมือซ้ายไปเก็บที่เก็บกระป๋องซ้าย
    arm_updown(0);
    //////////////////////////////////////////////////
    turnGyro(70, 180, true);   //----->>หมุนตามทิศ
    move(40,  40, 1.5, 30, 10, 2);
    /////////////////////////////////////////////////
    turnGyro(70, 90, true);   //----->>หมุนตามทิศ
    move(40,  40, 1.5, 30, 10, 2);
    delay(400);
    move(-40,  -40, 1.5, 30, 10, 2);
    setrobot_bw(1);   //----->>ถอยหลังเซต
    turnGyro(70, 180, true);   //----->>หมุนตามทิศ
    go_mission_on_stand(); //เข้าคีบบนแท่น 5 เซนติเมตร
    ////////////////////////////////////////////////
    move(-40,  -40, 1.5, 31, 10, 4);
    turnGyro(70, 90, true);   //----->>หมุนตามทิศ
    move(-40,  -40, 1.5, 30, 10, 4);
    setrobot_bw(1);   //----->>ถอยหลังเซต
    
    turnGyro(70, 0, true);   //----->>หมุนตามทิศ
    /////////////////////////////////////////////////////////////////////////////////////////////
    arm_updown(10);
    go_to_mission_on_stand('R', arm_shoulderL_begin - 50);     //############ วางบนแท่นตรงกลาง
    can_to_armR_5cm();
    go_to_mission_on_stand('R', arm_shoulderL_begin + 5);     //############ วางบนแท่นตรงด้านขอบ
    armL_to_armR(); 
    armR_to_can();      //เอากระป๋องจากมือ  ขวา  ไปเก็บที่เก็บกระป๋องขวา
    arm_updown(0);
    /////////////////////////////////////////////////////////////////////////////////////////////วางกระป๋องแรก เหลือง
    move(-40,  -40, 1.5, 3, 10, 2);
    arm_updown(0);
    turnGyro(70, 90, true);   //----->>หมุนตามทิศ
    arm_updown(0);
    setrobot_bw(1);   //----->>ถอยหลังเซต
    arm_updown(0);
    move(40,  40, 1.5, 30, 10, 2);
    turnGyro(70, 180, true);   //----->>หมุนตามทิศ

    move(-40,  -40, 1.5, 28, 10, 2);
    setrobot_bw(1);   //----->>ถอยหลังเซต
    turnGyro(70, 90, true);   //----->>หมุนตามทิศ
    move(70, 70, 1.5, 55, 10, 2);
    turnGyro(70, 180, true); 
    setrobot_bw(1);   //----->>ถอยหลังเซต

    move(70, 70, 1.5, 85, 0, 5);
    setrobot_fw(1);   //----->>เดินหน้าเซตเซต
    turnGyro(70, -90, true);   //----->>หมุนตามทิศ
    setrobot_fw(1);   //----->>เดินหน้าเซตเซต
    
    move(-40,  -40, 1.5, 33, 10, 2);
    turnGyro(70, 0, true);   //----->>หมุนตามทิศ
    setrobot_bw(1);   //----->>ถอยหลังเซต
    move_bridge(40,  40, 1.5, 65, 0, 2);

    setrobot_fw(1);   //----->>เดินหน้าเซตเซต
    turnGyro(70, 90, true);   //----->>หมุนตามทิศ
    setrobot_bw(1);   //----->>ถอยหลังเซต
    move_chopsticks(35,  35, 1.5, 110, 0, 4);

    setrobot_fw(1);   //----->>เดินหน้าเซตเซต
    turnGyro(70, 0, true);   //----->>หมุนตามทิศ
    move(-70, -70, 1.5, 60, 0, 2);
    setrobot_bw(1);   //----->>เดินหน้าเซตเซต

    turnGyro(70, -90, true);   //----->>หมุนตามทิศ
    move(40,  40, 1.5, 30, 10, 2);
    turnGyro(70, 0, true);   //----->>หมุนตามทิศ
    move(40,  40, 1.5, 27, 10, 2);

    turnGyro(70, -90, true);   //----->>หมุนตามทิศ
    setrobot_bw(1);   //----->>เดินหน้าเซตเซต
    arm_ready();
    go_mission_on_floor();  // เข้าคีบที่พื้น
    setrobot_bw(1);   //----->>เดินหน้าเซตเซต

    turnGyro(70, 0, true);   //----->>หมุนตามทิศ
    move(-40,  -40, 1.5, 30, 0, 4);
    setrobot_bw(1);   //----->>ถอยหลังเซต
    turnGyro(70, -90, true);   //----->>หมุนตามทิศ

    arm_updown(16);
    go_to_mission_on_stand('R', arm_shoulderL_begin - 30);     //############ วางบนแท่นตรงกลาง
    armL_to_armR(); 
    can_to_armL_10cm();
    go_to_mission_on_stand('L', arm_shoulderL_begin + 20);     //############ วางบนแท่นตรงด้านขอบ
    armR_to_armL();     //เอากระป๋องจากมือ  ขวา  ไปเก็บที่เก็บกระป๋องขวา
    armL_to_can();      //เอากระป๋องจากมือ  ซ้าย  ไปเก็บที่เก็บกระป๋องซ้าย    

    arm_updown(0);
   
    move(-40,  -40, 1.5, 30, 0, 2);
    setrobot_bw(1);   //----->>เดินหน้าเซตเซต
    turnGyro(70, 0, true);   //----->>หมุนตามทิศ
    move(70, 70, 1.5, 55, 10, 2);

    turnGyro(70, -90, true);   //----->>หมุนตามทิศ
    setrobot_bw(1);   //----->>เดินหน้าเซตเซต
    move_chopsticks(35,  35, 1.5, 110, 0, 4);
    setrobot_fw(1);   //----->>เดินหน้าเซตเซต

    turnGyro(70, 0, true);   //----->>หมุนตามทิศ
    move(-70, -70, 1.5, 60, 0, 2);
    setrobot_bw(1);   //----->>เดินหน้าเซตเซต
    turnGyro(70, -90, true);   //----->>หมุนตามทิศ

    move(40,  40, 1.5, 30, 10, 2);
    turnGyro(70, 0, true);   //----->>หมุนตามทิศ
    move(70, 70, 1.5, 85, 0, 5);
    setrobot_fw(1);   //----->>เดินหน้าเซตเซต
    turnGyro(70, 90, true);   //----->>หมุนตามทิศ

    move(40,  40, 1.5, 30, 10, 2);
    arm_updown(19);
    go_to_mission_on_stand('T', arm_shoulderL_begin);          //############ วางบนแท่นปกติ
  }



  
  

    

