#include <my_rpProV2.h>

//----------------------------------------------------------------------------->> ตั้งค่ามือจับ
int servo_down = 40;        //-------------------->> ตั้งค่า มื่อจับลงขนานกับพื้น
int servoL_open = 120;      //-------------------->> ตั้งค่า กางฝ่ามือด้านซ้าย
int servoR_open = 120;      //-------------------->> ตั้งค่า กางฝ่ามือด้านขวา
//----------------------------------------------------------------------------->> ตั้งค่ามือจับ

void setup() 
  {
    setup_rp2350_pro();
    set_motor();
    //min_center(150, 150);  //   min_center(ซ้าย, ขวา);
    //max_center(850, 850);  //   max_center(ซ้าย, ขวา);
    //----------------------------------------------------------------------------->> ตั้งค่ามือจับ
    s34_trim(0);
    s35_trim(20);
    s36_trim(0);
    //----------------------------------------------------------------------------->> ตั้งค่ามือจับ

   //------------------------->>  ส่วนของคำสั่งในการเตรียมแขนกล 
    arm_left_right(servoL_open, servoR_open, 50);
    arm_up_down(servo_down, 50) ;
   //------------------------->>  ส่วนของคำสั่งในการเตรียมแขนกล 
    sw();  //--->> คำสั่งรอกดปุ่ม
   
    ////------------------------------------------------------------------------------>> รันคำสั่งต่าง ๆ ที่นี่
    
     fline(40, 40, 0.45, 0, 'c', 'r', 50, "a5", 20); 
     fline(40, 40, 0.45, 0, 'c', 's', 50, "a5", 20); 

 

    ////------------------------------------------------------------------------------>> จบการรันคำสั่งต่าง ๆ 

  }

void loop() 
  {
    

    //Serial.print(my.gyro('z')); Serial.println( "   " ); 
    //Serial.print( analogRead(46) );   Serial.print( "   " );   Serial.print( analogRead(47) ); 
    //Serial.print( "   " ); 
    Serial.print( sensorMinC[0] );   Serial.print( "   " );   Serial.print( sensorMinC[1] ); 
    Serial.print( "   " ); 
     Serial.print( sensorMaxC[0] );   Serial.print( "   " );   Serial.println( sensorMaxC[1] );  
    delay(10);
     //Serial.print(sensorMinA[0] );

  }
