#include <myrp_pico2.h>

//----------------------------------------------------------------------------->> ตั้งค่ามือจับ
int servo_down = 55;        //-------------------->> ตั้งค่า มื่อจับลงขนานกับพื้น
int servoL_open = 120;      //-------------------->> ตั้งค่า กางฝ่ามือด้านซ้าย
int servoR_open = 120;      //-------------------->> ตั้งค่า กางฝ่ามือด้านขวา
//----------------------------------------------------------------------------->> ตั้งค่ามือจับ
//----------------------------------------------------------------------------->> ตั้งค่ามือจับ
#define MCP3421_ADDR 0x68  // I2C Address when A0 = GND  


void setup() 
  {
    setup_robot() ;
    set_motor();
    encoder.setupEncoder();    //-------------------->> เรียกฟังก์ชัน setupEncoder
    encoder.resetEncoders();  //--------------------->> ฟังก์ชันรอก
    //----------------------------------------------------------------------------->> ตั้งค่ามือจับ
   // s34_trim(0);
   // s35_trim(20);
   // s36_trim(0);
  //----------------------------------------------------------------------------->> ตั้งค่ามือจับ
    arm_down_open();
   //------------------------->>  ส่วนของคำสั่งในการเตรียมแขนกล 
 
    sw();  //--->> คำสั่งรอกดปุ่ม
    
   
    ////------------------------------------------------------------------------------>> รันคำสั่งต่าง ๆ ที่นี่
   

   

    ////------------------------------------------------------------------------------>> จบการรันคำสั่งต่าง ๆ 
  
  }

void loop() 
  {

   
   Serial.print("my.gyro('z') :");Serial.print(my.gyro('z')); Serial.println( "   " ); 
      
  delay(10);
     //Serial.print(sensorMin_A[0] );

  }
